### Introduction
In this task, we have Car-Ads dataset from kaggle. The dataset has 16 unique columns - features and almost 3.5 Million rows. Our task is to build a model which will predict the price of the car in euros with the help of these 16 features.

### Importing important libraries

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.impute import SimpleImputer

### Loading the dataset

In [99]:
df = pd.read_csv("personal-cars-classifieds/all_anonymized_2015_11_2017_03.csv")

In [100]:
df.head()

,maker,model,mileage,manufacture_year,engine_displacement,engine_power,body_type,color_slug,stk_year,transmission,door_count,seat_count,fuel_type,date_created,date_last_seen,price_eur
0,ford,galaxy,151000.0,2011.0,2000.0,103.0,NaN,NaN,None,man,5,7,diesel,2015-11-14 18:10:06.838319+00,2016-01-27 20:40:15.46361+00,10584.75
1,skoda,octavia,143476.0,2012.0,2000.0,81.0,NaN,NaN,None,man,5,5,diesel,2015-11-14 18:10:06.853411+00,2016-01-27 20:40:15.46361+00,8882.31
2,bmw,NaN,97676.0,2010.0,1995.0,85.0,NaN,NaN,None,man,5,5,diesel,2015-11-14 18:10:06.861792+00,2016-01-27 20:40:15.46361+00,12065.06
3,skoda,fabia,111970.0,2004.0,1200.0,47.0,NaN,NaN,None,man,5,5,gasoline,2015-11-14 18:10:06.872313+00,2016-01-27 20:40:15.46361+00,2960.77
4,skoda,fabia,128886.0,2004.0,1200.0,47.0,NaN,NaN,None,man,5,5,gasoline,2015-11-14 18:10:06.880335+00,2016-01-27 20:40:15.46361+00,2738.71

Let's see the data types of each column of the dataset. This will give us the intuition about whether we have to convert into single data types or not.

In [101]:
df.dtypes

maker                   object
model                   object
mileage                float64
manufacture_year       float64
engine_displacement    float64
engine_power           float64
body_type               object
color_slug              object
stk_year                object
transmission            object
door_count              object
seat_count              object
fuel_type               object
date_created            object
date_last_seen          object
price_eur              float64
dtype: object

From above table, we can see that apart from `mileage`, `manufacture_year`, `engine_displacement`, `engine_powe`, and `price_eur`, all columns have object type data types. It means we have to convert into only one type.

### Handling Missing Values

Let's see how many missing values are present in each columns of the datasets by following.

In [102]:
df.isnull().sum().sort_values(ascending=False)

color_slug             3343411
fuel_type              1847606
stk_year               1708156
model                  1133361
body_type              1122914
seat_count              749489
engine_displacement     743414
transmission            741630
door_count              614373
engine_power            554877
maker                   518915
manufacture_year        370578
mileage                 362584
price_eur                    0
date_last_seen               0
date_created                 0
dtype: int64

From above, we are dropping `color_slug` feature column because it has more than 3 Million missing values. Here, we are dropping `date_last_seen` column also, because the date last seen the car doesn't affect the price of the car.

In [103]:
df = df.drop(['color_slug', 'date_last_seen'], axis=1)

As we have seen object type columns. Now, let's convert `door_count` and `seat_count` columns into numerical one.

In [104]:
print(df['door_count'].value_counts())

5.0     777522
4       636217
4.0     494524
None    475693
2       164077
2.0     143747
5       116562
3.0     106527
3        14066
0.0       8010
6.0        906
6          347
1.0        259
7.0         41
1           14
55.0         9
9.0          4
8.0          3
58.0         3
7            2
17.0         1
22.0         1
49.0         1
54.0         1
77.0         1
45.0         1
Name: door_count, dtype: int64

In [105]:
df_sc = df['seat_count']
df_dc = df['door_count']
df_sc = df_sc.replace({'None':-1})
df_dc = df_dc.replace({'None':-1})

Now, convert each `door_count` and `seat_count` columns into floating type.

In [106]:
df_sc = df_sc.astype(float)
df_dc = df_dc.astype(float)

Again, replace `-1` values by missing values `np.nan` so that later it will be easier to replace with `fillna` function.

In [107]:
df_sc = df_sc.replace({-1: np.nan})
df_dc = df_dc.replace({-1: np.nan})
df['seat_count'] = df_sc
df['door_count'] = df_dc

We have converted `door_count` and `seat_count` columns into the floating type. Now, we will see the outliers in each columns and replace them.

In [108]:
df['seat_count'].value_counts()

5.0      1767868
4.0       244797
7.0       100744
2.0        72685
3.0        33607
6.0        14174
9.0        12575
0.0        11695
8.0         6754
1.0          567
17.0          39
10.0          35
12.0          31
14.0          19
15.0          19
18.0          16
19.0          14
21.0          13
23.0          13
45.0          13
20.0          13
13.0          10
50.0           9
16.0           9
55.0           8
11.0           8
57.0           7
51.0           7
58.0           6
56.0           5
25.0           4
54.0           4
52.0           3
24.0           3
29.0           3
81.0           3
36.0           3
53.0           3
512.0          2
74.0           2
27.0           2
49.0           2
44.0           2
33.0           2
32.0           2
30.0           2
255.0          1
43.0           1
59.0           1
61.0           1
65.0           1
22.0           1
85.0           1
517.0          1
515.0          1
138.0          1
26.0           1
Name: seat_count, dtype: int64

In [109]:
df['door_count'].value_counts()

4.0     1130741
5.0      894084
2.0      307824
3.0      120593
0.0        8010
6.0        1253
1.0         273
7.0          43
55.0          9
9.0           4
8.0           3
58.0          3
22.0          1
17.0          1
77.0          1
45.0          1
49.0          1
54.0          1
Name: door_count, dtype: int64

Since, this is the dataset of a car. Hence, we are making an assumption that seat count and door count have maximum values of 9 and 5 respectively.

In [110]:
df_sc = df['seat_count'].apply(lambda x: np.nan if x > 10 else x)
df_dc = df['door_count'].apply(lambda x: np.nan if x > 6 else x)

In [111]:
columns = df.columns.values
for column in columns:
    print("\nFor {0} column\n".format(column), "="*30)
    print(df[column].value_counts())

For maker column
 ==============================
skoda            313830
volkswagen       297256
bmw              266731
mercedes-benz    251966
audi             248602
ford             240556
opel             217708
fiat             132669
citroen          121913
renault          106831
peugeot           92130
hyundai           80602
seat              74645
toyota            72908
nissan            68008
kia               48607
volvo             48271
mazda             45666
mini              35678
smart             32918
suzuki            31184
mitsubishi        28463
honda             26225
porsche           24317
chevrolet         20856
rover             20611
jeep              17075
lancia            13759
subaru            10107
jaguar            10056
chrysler           9296
dodge              5223
alfa-romeo         4734
lexus              3911
dacia              2024
maserati           1912
land-rover         1721
isuzu              1427
bentley            1081
hummer              731
lamborghini         554
infinity            506
lotus               426
tesla               235
rolls-royce          46
aston-martin         22
Name: maker, dtype: int64

For model column
 ==============================
octavia       129563
fabia          91401
golf           91234
focus          61137
astra          58376
               ...
cls250-cdi         1
stanza             1
225d               1
125d               1
ml250-cdi          1
Name: model, Length: 1012, dtype: int64

For mileage column
 ==============================
0.0         162393
10.0        107072
1.0          34690
100.0        25844
5.0          21051
             ...
243886.0         1
243887.0         1
243889.0         1
243892.0         1
276889.0         1
Name: mileage, Length: 248142, dtype: int64

For manufacture_year column
 ==============================
2015.0    441383
2012.0    246152
2011.0    219843
2014.0    201342
2013.0    165305
           ...
1544.0         1
1549.0         1
1555.0         1
1557.0         1
1553.0         1
Name: manufacture_year, Length: 1640, dtype: int64

For engine_displacement column
 ==============================
1968.0    215375
1598.0    208528
1995.0    112588
1560.0     77824
1197.0     76250
           ...
8682.0         1
8660.0         1
8640.0         1
8612.0         1
2.0            1
Name: engine_displacement, Length: 7272, dtype: int64

For engine_power column
 ==============================
103.0    167081
110.0    163112
77.0     150875
66.0     145297
55.0     126331
          ...
796.0         1
800.0         1
802.0         1
805.0         1
511.0         1
Name: engine_power, Length: 641, dtype: int64

For body_type column
 ==============================
other           1964289
compact          241948
coupe             70576
stationwagon      69895
van               31300
offroad           22549
sedan             19669
convertible        5332
transporter        4440
Name: body_type, dtype: int64

For stk_year column
 ==============================
None      1308651
2018.0     169746
2017.0     142800
2016.0      98793
2019.0      41482
           ...
7500            1
7282.0          1
7279.0          1
7250.0          1
7223.0          1
Name: stk_year, Length: 298, dtype: int64

For transmission column
 ==============================
man     2021990
auto     789292
Name: transmission, dtype: int64

For door_count column
 ==============================
4.0     1130741
5.0      894084
2.0      307824
3.0      120593
0.0        8010
6.0        1253
1.0         273
7.0          43
55.0          9
9.0           4
8.0           3
58.0          3
22.0          1
17.0          1
77.0          1
45.0          1
49.0          1
54.0          1
Name: door_count, dtype: int64

For seat_count column
 ==============================
5.0      1767868
4.0       244797
7.0       100744
2.0        72685
3.0        33607
6.0        14174
9.0        12575
0.0        11695
8.0         6754
1.0          567
17.0          39
10.0          35
12.0          31
14.0          19
15.0          19
18.0          16
19.0          14
21.0          13
23.0          13
45.0          13
20.0          13
13.0          10
50.0           9
16.0           9
55.0           8
11.0           8
57.0           7
51.0           7
58.0           6
56.0           5
25.0           4
54.0           4
52.0           3
24.0           3
29.0           3
81.0           3
36.0           3
53.0           3
512.0          2
74.0           2
27.0           2
49.0           2
44.0           2
33.0           2
32.0           2
30.0           2
255.0          1
43.0           1
59.0           1
61.0           1
65.0           1
22.0           1
85.0           1
517.0          1
515.0          1
138.0          1
26.0           1
Name: seat_count, dtype: int64

For fuel_type column
 ==============================
gasoline    902222
diesel      768207
electric     26350
lpg           7403
cng           1124
Name: fuel_type, dtype: int64

For date_created column
 ==============================
2016-03-08 20:11:43.695587+00    1
2016-03-09 12:06:13.520711+00    1
2017-02-07 20:58:18.176958+00    1
2016-02-21 01:59:00.034489+00    1
2016-11-26 17:42:49.126952+00    1
                                ..
2015-12-08 21:50:30.013567+00    1
2016-02-24 16:40:10.188357+00    1
2015-12-29 17:38:53.315807+00    1
2016-01-06 18:11:07.635637+00    1
2015-12-13 18:06:25.186283+00    1
Name: date_created, Length: 3552912, dtype: int64

For price_eur column
 ==============================
1295.34     673623
9900.00       6609
10900.00      6497
12900.00      6274
11900.00      6169
             ...
19978.76         1
10202.07         1
18884.72         1
31003.00         1
21798.45         1
Name: price_eur, Length: 227305, dtype: int64

We can see that most frequent number in seat count and door count are 5 and 4 respectively. So, we are filling the nan values with these values. Along with this, we are also replacing -1, 0 and 1 values with most frequent for door count as well as 0 and 1 value with most frequent for seat count.

In [112]:
df_dc = df_dc.fillna(4)
df_sc = df_sc.fillna(5)
df_dc = df_dc.replace({-1:4, 0:4, 1:4})
df_sc = df_sc.replace({0:5, 1:5})

In [113]:
df['seat_count'] = df_sc
df['door_count'] = df_dc

Now, we are filling the nan values of `engine_power` and `mileage` columns by grouping the related columns as follows:

In [114]:
df['engine_power'] = df['engine_power'].fillna(df.groupby(['maker', 'manufacture_year', 'mileage', 'model'])['engine_power'].transform('median'))
df['engine_power'] = df['engine_power'].fillna(df.groupby(['maker'])['engine_power'].transform('median'))
df['engine_power'] = df['engine_power'].fillna(df.groupby(['manufacture_year'])['engine_power'].transform('median'))
df['engine_power'] = df['engine_power'].fillna(df.groupby(['mileage'])['engine_power'].transform('median'))
df['engine_power'] = df['engine_power'].fillna(df.groupby(['model'])['engine_power'].transform('median'))

In [115]:
df['mileage'] = df['mileage'].fillna(df.groupby(['maker', 'manufacture_year', 'model', 'engine_power'])['mileage'].transform("median"))
df['mileage'] = df['mileage'].fillna(df.groupby(['maker'])['mileage'].transform("median"))
df['mileage'] = df['mileage'].fillna(df.groupby(['manufacture_year'])['mileage'].transform("median"))
df['mileage'] = df['mileage'].fillna(df.groupby(['model'])['mileage'].transform("median"))
df['mileage'] = df['mileage'].fillna(df.groupby(['engine_power'])['mileage'].transform("median"))

In [117]:
df.tail()

,maker,model,mileage,manufacture_year,engine_displacement,engine_power,body_type,stk_year,transmission,door_count,seat_count,fuel_type,date_created,price_eur
3552907,skoda,roomster,54000.0,2013.0,1200.0,63.0,other,NaN,NaN,4.0,5.0,NaN,2017-03-16 18:57:35.46558+00,1295.34
3552908,skoda,felicia,138150.0,2000.0,NaN,50.0,other,NaN,NaN,4.0,5.0,electric,2017-03-16 18:57:37.761349+00,1295.34
3552909,skoda,octavia,230000.0,2006.0,1900.0,100.0,other,NaN,NaN,4.0,5.0,NaN,2017-03-16 18:57:40.435847+00,1295.34
3552910,skoda,fabia,141235.0,2001.0,NaN,77.0,other,NaN,NaN,4.0,5.0,NaN,2017-03-16 18:57:43.595523+00,1295.34
3552911,mercedes-benz,NaN,92000.0,NaN,NaN,120.0,other,NaN,NaN,4.0,5.0,NaN,2017-03-16 19:22:23.946774+00,1295.34

In [118]:
df.corr()

,mileage,manufacture_year,engine_displacement,engine_power,door_count,seat_count,price_eur
mileage,1.000000,-0.036942,0.093663,-0.012280,0.001577,0.016885,-0.000152
manufacture_year,-0.036942,1.000000,-0.044598,0.033446,0.016460,-0.006923,-0.000004
engine_displacement,0.093663,-0.044598,1.000000,0.282297,-0.024624,0.009364,0.003932
engine_power,-0.012280,0.033446,0.282297,1.000000,-0.057990,-0.027738,0.000160
door_count,0.001577,0.016460,-0.024624,-0.057990,1.000000,0.349288,-0.000047
seat_count,0.016885,-0.006923,0.009364,-0.027738,0.349288,1.000000,0.000078
price_eur,-0.000152,-0.000004,0.003932,0.000160,-0.000047,0.000078,1.000000

From above table, we can see that, `engine_displacement` column has very good correlation on price of the car. So, we are filling the missing value of this column with groupby function as above.

In [119]:
df_ed = df['engine_displacement']

In [120]:
df_ed = df_ed.fillna(df.groupby(['maker', 'model', 'manufacture_year', 'engine_power'])['engine_displacement'].transform('median'))
df_ed = df_ed.fillna(df.groupby(['maker'])['engine_displacement'].transform('median'))
df_ed = df_ed.fillna(df.groupby(['model'])['engine_displacement'].transform('median'))
df_ed = df_ed.fillna(df.groupby(['manufacture_year'])['engine_displacement'].transform('median'))
df_ed = df_ed.fillna(df.groupby(['engine_power'])['engine_displacement'].transform('median'))

In [121]:
df['engine_displacement'] = df_ed

In [122]:
df_test = df

In [123]:
df['manufacture_year'] = df['manufacture_year'].fillna(df.groupby(['maker', 'engine_power', 'mileage', 'model'])['manufacture_year'].transform('median'))
df['manufacture_year'] = df['manufacture_year'].fillna(df.groupby(['maker'])['manufacture_year'].transform('median'))
df['manufacture_year'] = df['manufacture_year'].fillna(df.groupby(['engine_power'])['manufacture_year'].transform('median'))
df['manufacture_year'] = df['manufacture_year'].fillna(df.groupby(['mileage'])['manufacture_year'].transform('median'))
df['manufacture_year'] = df['manufacture_year'].fillna(df.groupby(['model'])['manufacture_year'].transform('median'))

In [124]:
df.isnull().sum().sort_values(ascending=False)

fuel_type              1847606
stk_year               1708156
model                  1133361
body_type              1122914
transmission            741630
maker                   518915
engine_power             31551
manufacture_year         31511
mileage                  31472
engine_displacement      24639
price_eur                    0
date_created                 0
seat_count                   0
door_count                   0
dtype: int64

In [125]:
df['fuel_type'] = df['fuel_type'].fillna('gasoline')

In [139]:
df['stk_year'] = df['stk_year'].fillna(2018)
df['stk_year'] = df['stk_year'].replace({'None': 2018})
df['body_type'] = df['body_type'].fillna('other')
df['transmission'] = df['transmission'].fillna('man')
df['maker'] = df['maker'].fillna('skoda')
df['model'] = df['model'].fillna('octavia')

In [127]:
df.isnull().sum().sort_values(ascending=False)

engine_power           31551
manufacture_year       31511
mileage                31472
engine_displacement    24639
price_eur                  0
date_created               0
fuel_type                  0
seat_count                 0
door_count                 0
transmission               0
stk_year                   0
body_type                  0
model                      0
maker                      0
dtype: int64

In [128]:
df['engine_power'] = df['engine_power'].fillna(df['engine_power'].mean())

In [145]:
df['manufacture_year'] = df['manufacture_year'].fillna(df['manufacture_year'].mode()[0])

In [130]:
df['mileage'] = df['mileage'].fillna(df['mileage'].mean())

In [131]:
df['engine_displacement'] = df['engine_displacement'].fillna(df['engine_displacement'].mean())

In [146]:
df.isnull().sum().sort_values(ascending=False)

price_eur              0
date_created           0
fuel_type              0
seat_count             0
door_count             0
transmission           0
stk_year               0
body_type              0
engine_power           0
engine_displacement    0
manufacture_year       0
mileage                0
model                  0
maker                  0
dtype: int64

In [148]:
category_column = []
for column in columns:
    if df[column].dtypes == 'object':
        category_column.append(column)

In [153]:
category_column.remove('stk_year')

In [154]:
category_column.remove('date_created')

In [155]:
category_column

['maker', 'model', 'body_type', 'transmission', 'fuel_type']

In [162]:
df = df.drop('date_created', axis=1)

In [170]:
data = df.values

In [171]:
df.head()

,maker,model,mileage,manufacture_year,engine_displacement,engine_power,body_type,stk_year,transmission,door_count,seat_count,fuel_type,price_eur
0,ford,galaxy,151000.0,2011.0,2000.0,103.0,other,2018,man,5.0,7.0,diesel,10584.75
1,skoda,octavia,143476.0,2012.0,2000.0,81.0,other,2018,man,5.0,5.0,diesel,8882.31
2,bmw,octavia,97676.0,2010.0,1995.0,85.0,other,2018,man,5.0,5.0,diesel,12065.06
3,skoda,fabia,111970.0,2004.0,1200.0,47.0,other,2018,man,5.0,5.0,gasoline,2960.77
4,skoda,fabia,128886.0,2004.0,1200.0,47.0,other,2018,man,5.0,5.0,gasoline,2738.71

In [172]:
columns_index = [0, 1, 6, 8, 11]

In [173]:
from sklearn.preprocessing import LabelEncoder

In [174]:
for column in columns_index:
    model_encoder = LabelEncoder()
    data[:, column] = model_encoder.fit_transform(data[:, column])

In [175]:
data

array([[11, 484, 151000.0, ..., 7.0, 1, 10584.75],
       [38, 679, 143476.0, ..., 5.0, 1, 8882.31],
       [4, 679, 97676.0, ..., 5.0, 1, 12065.06],
       ...,
       [38, 679, 230000.0, ..., 5.0, 3, 1295.34],
       [38, 450, 141235.0, ..., 5.0, 3, 1295.34],
       [27, 679, 92000.0, ..., 5.0, 3, 1295.34]], dtype=object)

In [176]:
X = data[:, :-1]
Y = data[:, -1]

In [179]:
X.shape

(3552912, 12)

In [180]:
Y.shape

(3552912,)